{"projects":[
    {   "id": "0" ,
        "name": "AJPHNX.com",
        "url": "https://ajphnx.com/index.html",
        "deployment": {
            "frontend": "Blue Host",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "Landing Page",
        "year": "2021",
        "technologies": ["HTML5","CSS3","Js6"],
        "description": "Personal landing page for my creative endeavors",
        "restrictions":"",
        "status": "Deployed",
        "repo": [{
            "title": "N/A",
            "link":"N/A"}],
        "info":{
           "inspiration":"",
           "implementation":[],
           "lessons":"",
           "reviews":""
        }
    },
    {   "id": "1" , 
        "name": "theNDAer qr landing page",
        "url": "https://ajphnx.github.io/NDAerLander/",
        "deployment": {
            "frontend": "Github Pages",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "Landing Page",
        "year": "2021",
        "technologies": ["HTML5","CSS3","Js6"],
        "description": "Temporary static landing page (pun included) for \"theNDAer\" QR",
        "restrictions":"",
        "status": "Deployed",
        "repo": [{
            "title": "The NDAer Landing page",
            "link": "https://github.com/AJPHNX/NDAerLander"}],
        "info":{
           "inspiration":"",
           "implementation":[],
           "lessons":"",
           "reviews":""
        }
    },
    {
        "id": "2" ,
        "name": "theNDAer",
        "url": "https://www.youtube.com/embed/dnK1TE6qxag",
        "deployment": {
            "frontend": "Netlify",
            "backend": "Render",
            "database": "ElephantSQL"
        },
        "type": "Fullstack Mobile",
        "year": "2022",
        "technologies": ["React","CSS3","react-router-DOM","passage.id","react-to-pdf","html2canvas","Axios","knex","Node","Express","postgresQL"],
        "description":"Fullstack mobile browser-based application, created for generating and signing non-disclosure agreements on the fly",
        "restrictions":"",
        "status": "Beta(redeploy pending)",
        "repo": [{
            "title": "Monorepo",
            "link":"https://github.com/AJPHNX/NDAer"}
            ],
        "info":{
           "inspiration":"Initially conceived as a mini side-project to preface an upcoming final group project I had for bootcamp, the window shortened before being able to get the skeletal version up and running. Seeing the benefit of such a tool, I decided to pan out the functionality and features to make a more diverse full stack application. Because I wanted to, a.) more familiarize myself with the technologies I would be implementing in the future project, and b.) become aware of those areas of I could use some strengthening in general, I chose to go at it solo.",
           "implementation":[
            "Establish a legal binding space for collaboration and/or consultation",
            "tba"],
           "lessons":"In general a better awareness of state managment and persistance. Deciding to pan out what was intended to be a short run/single use product gave me the opportunity to not only delve into the inital single document format but, it also provided me the chance to expand the scope of the MVP. Transitioning to the muti-document format allowed for me to practice implementing new additions and features to and already establish model.",
           "reviews":"23/25"
        }
    },
    {
        "id": "3" ,
        "name": "nVentory",
        "url": "https://www.youtube.com/embed/R3phVxbPRXA",
        "deployment": {
            "frontend": "Heroku",
            "backend": "Heroku",
            "database": "Heroku"
        },
        "type": "Fullstack Mobile",
        "year": "2022",
        "technologies": ["React","CSS3","Axios","Express","postgresQL"],
        "description":"Fullstack PERN application utilizing microservices to handle front and back ends separately through an API/Mobile first design.",
        "restrictions":"",
        "status": "Beta(redeploy pending)",
        "repo": [{
            "title": "Frontend",
            "link":"https://github.com/kiqueangulo/nVentory-frontend/"},

            {"title": "Backend",
            "link":"https://github.com/kiqueangulo/nVentory-backend/"
            }
            ],
        "info":{
           "inspiration":"This application was thought of while working at a Shopify-based brick and mortar wine store where the slow and sometimes distracted process of organizing the space available inspired AJ to build a cleaner and easier system for tracking inventory.",
           "implementation":[
            "A visual bridge that allows the user to break their inventory up into personalized sections and subsections, allowing for a more manageable and streamlined inventory process and interaction.",
            "Allows shopify to stay on the computer/POS while you manage your inventory as it sits in your physical store via phone, tablet, or laptop."],
           "lessons":"A great experience with a strong team of 4(total) with a little under 2 weeks of class time, in our first collaborative effort/ full stack application. Throughout the project we implemented  AGILE/Scrum methodologies while holding true to our established MVP and adding possible  features in the allotted time. The main focus of our MVP was to ensure we were covering all the C.R.U.D. functionalities; rendering it fullstack, while still displaying some of the other intended features and functionalities of the user experience.",
           "reviews":"21/25"
        }
    },
    {   "id": "4" ,
        "name": "subEarth",
        "url": "https://ajphnx.github.io/SubEarth/",
        "deployment": {
            "frontend": "GitHub Pages",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "Browser Game",
        "year": "2022",
        "technologies": ["HTML5","CSS3","Js6"],
        "description": "Browser-based Game",
        "restrictions":"",
        "status": "In progress",
        "repo": [{
            "title": "Progress",
            "link":"https://github.com/AJPHNX/SubEarth"}],
        "info":{
           "inspiration":"This initial module of SubEarth is based on my work experience with the slicer at Jersey Mike’s Subs. Alongside making the sandwiches correctly, the goal is to handle the cue as optimally as possible by preloading it, and slicing as many of the like-sandwich components as you can, at the same time.",
           "implementation":[
               "A training system with immediate rewards based in stimuli and relatability (further solidifying a more enjoyable angle on the experience, triggered by notions of personal growth and gains)",
                "A passive marketing tool that implements an enjoyable call to action, that can potentially yield/be paired with rewards and benefits.(w3-ish in nature) ",
                "Away to kill some time making a bunch of sandwiches without...yah know…having to figure out what to do with them afterwards…A…low-impact sandwich construction outlet🤔🧐"
            ],
           "lessons":"Upon undertaking this project, I had the opportunity to explore and combine many of the learned skills from the first portion of my bootcamp up until Javascript. Although not complete(due to its ambitious nature for the time allotted), I still had the opportunity to utilize aspects of the AGILE process when coming to the point that it’d be more beneficial to refactor my code for the results I’m looking to achieve(which I am in the process of in between projects). After observing what data was needing to be handled and how, it became apparent that there was not just a dryer but more effective way to structure/handle the data and its interactions(state and effects)",
           "reviews":"25/25"
        }
    },
    {
        "id": "5" ,
        "name": "afterClass",
        "url": "./assets/afterclass.html",
        "deployment": {
            "frontend": "n/a",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "Fullstack Platform",
        "year": "2022",
        "technologies": ["figma"],
        "description":"FullStack Platform Mockup",
        "restrictions":"",
        "status": "Mockup",
        "repo": [{
            "title": "",
            "link": ""}],
        "info":{
           "inspiration": "While going through my fullstack bootcamp, there was a strong emphasis placed on the demand within the field, while still addressing the competitive nature as well. Another point shared was how important your cohort is in your continued growth, progress and sense of community.<br><br> Upon processing this information and poking around the Linkedins of some of my cohort-mates, I grew to see how eclectic their professional backgrounds and previous experiences were. Knowing we were all in this shared experience to further ourselves through this (possibly) new skill-set, I began to think how beneficial a space to approach projects based on what sparks our coding interests, and what we had to offer from previously established knowledge bases (ie. soft skills and industry awareness).<br><br>So, we have an array of skill-sets and drive but, not everyone has an idea just jumping out in the directions they’d like to explore. With the aid of filtered feeds based on preferences, one can create, browse, collaborate and/or follow projects and cohorts/clans of interest as they further their skill-sets solidifying their working knowledge in an environment designed to bridge the gap between learning, doing, and being." ,
          
           "implementation":[
            "Exploratory breeding space for industry changing technologies straight from the pulse.",
             "Shift the goal from focusing your growth on just pursuing 'big company'(because it's one of the few frames of reference in the field) to, pursuing meaningful projects that resonate with the direction an individual wants to move in, while showing continued professional and collaborative growth."
            ],
           "lessons":"Time is what it is...I initially wanted to pitch the project to my cohort in hopes of being able to create that space out of its own necessity and ability. Make a cool thing that can help others make the cool things.",
           "reviews":""
        }
    },
    {
        "id": "6",
        "name": "SQL-Injection-Punching-Bag",
        "url": "https://si-punching-bag.netlify.app/",
        "deployment": {
            "frontend": "netlify",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "Node.js App",
        "year": "2022",
        "technologies": ["HTML5","CSS3","Js6"],
        "description":"A node app built to practice SQL-injection techniques and protections.",
        "restrictions":"",
        "status": "Beta",
        "repo": [{
            "title": "Progress",
            "link":"https://github.com/AJPHNX/SQL-Injection-Activity"}
            ],
        "info":{
           "inspiration":"I've always had an interest in cyber security and wanted a space to play around with what im learning.",
           "implementation":[
            "Practice",
            "Build out features to grow with my understandings"],
           "lessons":"",
           "reviews":""
        }
    },
    {
        "id": "7",
        "name": "Innerware",
        "url": "./assets/shirts.html",
        "deployment": {
            "frontend": "n/a",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "Digital Illustration",
        "year": "2018/2019",
        "technologies": ["Adobe Illustrator"],
        "description":"t-shirts & apparel",
        "restrictions":"",
        "status": "Beta",
        "repo": [{
            "title": "",
            "link":""}
            ],
        "info":{
           "inspiration":"",
           "implementation":[
            "",
            ""],
           "lessons":"",
           "reviews":""
        }
    },
    {
        "id": "8",
        "name": "Townhall",
        "url": "https://www.youtube.com/embed/TjuxrInmJws",
        "deployment": {
            "frontend": "n/a",
            "backend": "n/a",
            "database": "n/a"
        },
        "type": "React App",
        "year": "2022",
        "technologies": ["React","Passage.io","100ms","mongoDB"],
        "description":"",
        "restrictions":"",
        "status": "Beta",
        "repo": [{
            "title": "",
            "link":""}
            ],
        "info":{
           "inspiration":"",
           "implementation":[
            "",
            ""],
           "lessons":"",
           "reviews":""
        }
    }
]}